RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_lib.h
/*******************************************************************************
* Function Name: Cy_CapSense_AlpInitialize_Lib
****************************************************************************//**
*
* Initializes filter data structure.
*
* \param ptrFilterObj
* Pointer to filter data structure
*
* \param rawCount
* Pointer to sensor raw count
*
*******************************************************************************/
void Cy_CapSense_AlpInitialize_Lib(
                cy_stc_capsense_alp_fltr_channel_t * ptrFilterObj, 
                const uint16_t * rawCount);

/*******************************************************************************
* Function Name: Cy_CapSense_AlpResetState_Lib
****************************************************************************//**
*
* Resets state machine of the filter.
*
* \param ptrFilterObj
* Pointer to the filter data structure
*
*******************************************************************************/
void Cy_CapSense_AlpResetState_Lib(
                cy_stc_capsense_alp_fltr_channel_t * ptrFilterObj);

/*******************************************************************************
* Function Name: Cy_CapSense_AlpGetAverage_Lib
****************************************************************************//**
*
* Returns the output of internal average filter
*
* \param ptrFilterObj
* Pointer to the filter data structure
*
* \return
* Returns the output of internal average filter
*
*******************************************************************************/
uint32_t Cy_CapSense_AlpGetAverage_Lib(
                const cy_stc_capsense_alp_fltr_channel_t * ptrFilterObj);

/*******************************************************************************
* Function Name: Cy_CapSense_TunePrescalers_Lib
****************************************************************************//**
*
* This internal function tunes the Sense Clock divider.
*
* Found IDAC code in Single IDAC mode is used to calculate the optimal SnsClk.
* The SnsClk divider is set to meet the requirement that the widget 
* clock period should be greater than or equal to:
* Period > 2*5*R*Cp,
* where:
* * Cp is the maximum sensor parasitic capacitance within the widget.
* * R is the user input value in the expression view of the customizer for a 
*   series resistor.
*
* \param config
* The configuration structure.
*
* \return 
* Cp in fF (10^-15)
*
*******************************************************************************/
uint32_t Cy_CapSense_TunePrescalers_Lib(
                cy_stc_capsense_auto_tune_config_t * config);

/*******************************************************************************
* Function Name: Cy_CapSense_TuneSensitivity_Lib
****************************************************************************//**
*
* Configure scanning resolution to achieve the sufficient sensitivity.
*
* The function searches the lowest possible resolution that produces signal 
* greater than 50 counts (Difference Counts) for user defined finger capacitance.
* In addition, function calculates 75%-value of the achieved signal, that becomes 
* candidate to finger threshold.
*  
* Used equation to calculate signal at resolution 16-bit:
* sigPFCmax = (2^16-1) * vRef * snsClk * fingerCap / idacCurrent
*
* sigPFCmax contains absolute number of difference counts that user receives as 
* result of sensor scanning at corresponding resolution.
*
* This function requires non-zero Modulator IDAC code (if IDAC is equal to zero it 
* is considered as non-valid use case).
*
* \param config
* The configuration structure.
*
* \return 
* Scan resolution
*
*******************************************************************************/
uint8_t Cy_CapSense_TuneSensitivity_Lib(
                cy_stc_capsense_auto_tune_config_t * config);

/*******************************************************************************
* Function Name: Cy_CapSense_GetSmartSenseCapacitance
****************************************************************************//**
*
* Returns capacitance that corresponds to the provided parameters.
*
* Calculates sensor capacitance as follows:
*     Cp = Raw * RefCDAC / Nsub0
*
* \param autoTuneConfig
* The configuration structure.
*
* \return
* Returns capacitance in femto-farads.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetSmartSenseCapacitance(
                cy_stc_capsense_hw_smartsense_config_t * autoTuneConfig);

/*******************************************************************************
* Function Name: Cy_CapSense_GetSmartSenseFrequencyDivider
****************************************************************************//**
*
* Returns minimum sense clock divider.
*
* Calculates minimal sense clock divider as follows:
*     Kref = 4 * 5tau * Fmod * R * Cp
*
* \param autoTuneConfig
* The configuration structure.
*
* \return
* Returns sense clock divider.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetSmartSenseFrequencyDivider(
                cy_stc_capsense_hw_smartsense_config_t * autoTuneConfig);

/*******************************************************************************
* Function Name: Cy_CapSense_GetSmartSenseNumSubconversions
****************************************************************************//**
*
* Returns optimum number of sub-conversions.
*
* Calculates number of sub-conversions as follows:
*     Nsub = RoundUp(minRaw * RefCDAC * kRef0 /(sigPFC * kRef1)
*
* \param autoTuneConfig
* The configuration structure.
*
* \return
* Returns number of sub-conversions.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetSmartSenseNumSubconversions(
                cy_stc_capsense_hw_smartsense_config_t * autoTuneConfig);

/*******************************************************************************
* Function Name: Cy_CapSense_UpdateThresholds_Lib
****************************************************************************//**
*
* Updates noise and finger thresholds for a specified widget.
*
* This function comprises an algorithm of thresholds auto-tune. The thresholds
* object contains updated thresholds after this API is called.
*
* \param ptrNoiseEnvelope 
* The pointer to the noise-envelope object in RAM.
*
* \param ptrThresholds    
* The pointer to the thresholds object.
*
* \param sigPFC           
* Signal per finger capacitance.
*
* \param startFlag           
* The flag indicates a first sensor in a widget.
*
*******************************************************************************/
void Cy_CapSense_UpdateThresholds_Lib(
                const cy_stc_capsense_smartsense_csd_noise_envelope_t * ptrNoiseEnvelope,
                cy_stc_capsense_smartsense_update_thresholds_t * ptrThresholds,
                uint16_t sigPFC,
                uint32_t startFlag);

